pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore.h
/*

Copyright (c) 2010 - 2025, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#ifndef NRF9230_ENGB_RADIOCORE_H
#define NRF9230_ENGB_RADIOCORE_H

#ifdef __cplusplus
    extern "C" {
#endif


#ifdef NRF_RADIOCORE                                 /*!< Processor information is domain local.                               */


/* =========================================================================================================================== */
/* ================                                Interrupt Number Definition                                ================ */
/* =========================================================================================================================== */

typedef enum {
/* ===================================================== Core Interrupts ===================================================== */
  Reset_IRQn                             = -15,
  NonMaskableInt_IRQn                    = -14,
  HardFault_IRQn                         = -13,
  MemoryManagement_IRQn                  = -12,      /*!< -12 Memory Management, MPU mismatch, including Access Violation and No
                                                          Match*/
  BusFault_IRQn                          = -11,      /*!< -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory
                                                          related Fault*/
  UsageFault_IRQn                        = -10,
  SecureFault_IRQn                       = -9,
  SVCall_IRQn                            = -5,
  DebugMonitor_IRQn                      = -4,
  PendSV_IRQn                            = -2,
  SysTick_IRQn                           = -1,
/* ============================================== Processor Specific Interrupts ============================================== */
  SPU000_IRQn                            = 0,
  MPC_IRQn                               = 1,
  MVDMA_IRQn                             = 3,
  SPU010_IRQn                            = 16,
  WDT010_IRQn                            = 19,
  WDT011_IRQn                            = 20,
  SPU020_IRQn                            = 32,
  EGU020_IRQn                            = 37,
  TIMER020_IRQn                          = 40,
  TIMER021_IRQn                          = 41,
  TIMER022_IRQn                          = 42,
  RTC_IRQn                               = 43,
  RADIO_0_IRQn                           = 44,
  RADIO_1_IRQn                           = 45,
  SPU030_IRQn                            = 48,
  VPR_IRQn                               = 52,
  AAR030_CCM030_IRQn                     = 58,
  ECB030_IRQn                            = 59,
  AAR031_CCM031_IRQn                     = 60,
  ECB031_IRQn                            = 61,
  IPCT_0_IRQn                            = 64,
  IPCT_1_IRQn                            = 65,
  SWI0_IRQn                              = 88,
  SWI1_IRQn                              = 89,
  SWI2_IRQn                              = 90,
  SWI3_IRQn                              = 91,
  SWI4_IRQn                              = 92,
  SWI5_IRQn                              = 93,
  SWI6_IRQn                              = 94,
  SWI7_IRQn                              = 95,
  BELLBOARD_0_IRQn                       = 96,
  BELLBOARD_1_IRQn                       = 97,
  BELLBOARD_2_IRQn                       = 98,
  BELLBOARD_3_IRQn                       = 99,
  GPIOTE130_0_IRQn                       = 104,
  GPIOTE130_1_IRQn                       = 105,
  GPIOTE131_0_IRQn                       = 106,
  GPIOTE131_1_IRQn                       = 107,
  GRTC_0_IRQn                            = 108,
  GRTC_1_IRQn                            = 109,
  GRTC_2_IRQn                            = 110,
  TBM_IRQn                               = 127,
  USBHS_IRQn                             = 134,
  EXMIF_IRQn                             = 149,
  IPCT120_0_IRQn                         = 209,
  I3C120_IRQn                            = 211,
  VPR121_IRQn                            = 212,
  CAN120_IRQn                            = 216,
  MVDMA120_IRQn                          = 217,
  CAN121_IRQn                            = 219,
  MVDMA121_IRQn                          = 220,
  I3C121_IRQn                            = 222,
  TIMER120_IRQn                          = 226,
  TIMER121_IRQn                          = 227,
  PWM120_IRQn                            = 228,
  SPIS120_IRQn                           = 229,
  SPIM120_UARTE120_IRQn                  = 230,
  SPIM121_IRQn                           = 231,
  VPR130_IRQn                            = 264,
  IPCT130_0_IRQn                         = 289,
  RTC130_IRQn                            = 296,
  RTC131_IRQn                            = 297,
  WDT131_IRQn                            = 299,
  WDT132_IRQn                            = 300,
  EGU130_IRQn                            = 301,
  SAADC_IRQn                             = 386,
  COMP_LPCOMP_IRQn                       = 387,
  TEMP_IRQn                              = 388,
  I2S130_IRQn                            = 402,
  PDM_IRQn                               = 403,
  QDEC130_IRQn                           = 404,
  QDEC131_IRQn                           = 405,
  I2S131_IRQn                            = 407,
  TIMER130_IRQn                          = 418,
  TIMER131_IRQn                          = 419,
  PWM130_IRQn                            = 420,
  SERIAL0_IRQn                           = 421,
  SERIAL1_IRQn                           = 422,
  TIMER132_IRQn                          = 434,
  TIMER133_IRQn                          = 435,
  PWM131_IRQn                            = 436,
  SERIAL2_IRQn                           = 437,
  SERIAL3_IRQn                           = 438,
  TIMER134_IRQn                          = 450,
  TIMER135_IRQn                          = 451,
  PWM132_IRQn                            = 452,
  SERIAL4_IRQn                           = 453,
  SERIAL5_IRQn                           = 454,
  TIMER136_IRQn                          = 466,
  TIMER137_IRQn                          = 467,
  PWM133_IRQn                            = 468,
  SERIAL6_IRQn                           = 469,
  SERIAL7_IRQn                           = 470,
} IRQn_Type;

