pillo79/ArduinoCore-zephyr/variants/arduino_nano_33_ble_nrf52840_sense/llext-edk/include/modules/hal/nordic/nrfx/mdk/nrf9230_engb_radiocore.h
#include "core_cm33.h"
#include "system_nrf.h"

#endif                                               /*!< NRF_RADIOCORE                                                        */


#ifdef NRF_RADIOCORE

  #define NRF_DOMAIN                    NRF_DOMAIN_RADIOCORE
  #define NRF_PROCESSOR                 NRF_PROCESSOR_RADIOCORE
  #define NRF_OWNER                     NRF_OWNER_RADIOCORE

#endif                                               /*!< NRF_RADIOCORE                                                        */


/* ========================================= Start of section using anonymous unions ========================================= */

#include "compiler_abstraction.h"

#if defined (__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined (__ICCARM__)
  #pragma language=extended
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic push
  #pragma clang diagnostic ignored "-Wc11-extensions"
  #pragma clang diagnostic ignored "-Wreserved-id-macro"
  #pragma clang diagnostic ignored "-Wgnu-anonymous-struct"
  #pragma clang diagnostic ignored "-Wnested-anon-types"
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning 586
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Unsupported compiler type
#endif

/* =========================================================================================================================== */
/* ================                                  Peripheral Address Map                                  ================ */
/* =========================================================================================================================== */

#define NRF_RADIOCORE_ICACHEDATA_S_BASE   0x03F00000UL
#define NRF_RADIOCORE_ICACHEINFO_S_BASE   0x03F10000UL
#define NRF_RADIOCORE_UICR_NS_BASE        0x0FFFA000UL
#define NRF_RADIOCORE_DCACHEDATA_S_BASE   0x23F00000UL
#define NRF_RADIOCORE_DCACHEINFO_S_BASE   0x23F10000UL
#define NRF_RADIOCORE_ETM_NS_BASE         0xE0041000UL
#define NRF_RADIOCORE_CTI_S_BASE          0xE0042000UL
#define NRF_RADIOCORE_CPUC_S_BASE         0xE0080000UL
#define NRF_RADIOCORE_ICACHE_S_BASE       0xE0082000UL
#define NRF_RADIOCORE_DCACHE_S_BASE       0xE0083000UL
#define NRF_RADIOCORE_SPU000_S_BASE       0x53000000UL
#define NRF_RADIOCORE_MPC_S_BASE          0x53001000UL
#define NRF_RADIOCORE_MVDMA_NS_BASE       0x43003000UL
#define NRF_RADIOCORE_MVDMA_S_BASE        0x53003000UL
#define NRF_RADIOCORE_RAMC000_NS_BASE     0x43004000UL
#define NRF_RADIOCORE_RAMC000_S_BASE      0x53004000UL
#define NRF_RADIOCORE_HSFLL_S_BASE        0x5300D000UL
#define NRF_RADIOCORE_LRCCONF000_S_BASE   0x5300E000UL
#define NRF_RADIOCORE_SPU010_S_BASE       0x53010000UL
#define NRF_RADIOCORE_MEMCONF_NS_BASE     0x43012000UL
#define NRF_RADIOCORE_MEMCONF_S_BASE      0x53012000UL
#define NRF_RADIOCORE_WDT010_NS_BASE      0x43013000UL
#define NRF_RADIOCORE_WDT010_S_BASE       0x53013000UL
#define NRF_RADIOCORE_WDT011_NS_BASE      0x43014000UL
#define NRF_RADIOCORE_WDT011_S_BASE       0x53014000UL
#define NRF_RADIOCORE_LRCCONF010_S_BASE   0x5301E000UL
#define NRF_RADIOCORE_RESETINFO_S_BASE    0x5301E000UL
#define NRF_RADIOCORE_SPU020_S_BASE       0x53020000UL
#define NRF_RADIOCORE_DPPIC020_NS_BASE    0x43022000UL
#define NRF_RADIOCORE_DPPIC020_S_BASE     0x53022000UL
#define NRF_RADIOCORE_PPIB020_S_BASE      0x53023000UL
#define NRF_RADIOCORE_EGU020_NS_BASE      0x43025000UL
#define NRF_RADIOCORE_EGU020_S_BASE       0x53025000UL
#define NRF_RADIOCORE_TIMER020_NS_BASE    0x43028000UL
#define NRF_RADIOCORE_TIMER020_S_BASE     0x53028000UL
#define NRF_RADIOCORE_TIMER021_NS_BASE    0x43029000UL
#define NRF_RADIOCORE_TIMER021_S_BASE     0x53029000UL
#define NRF_RADIOCORE_TIMER022_NS_BASE    0x4302A000UL
#define NRF_RADIOCORE_TIMER022_S_BASE     0x5302A000UL
#define NRF_RADIOCORE_RTC_NS_BASE         0x4302B000UL
#define NRF_RADIOCORE_RTC_S_BASE          0x5302B000UL
#define NRF_RADIOCORE_RADIO_NS_BASE       0x4302C000UL
#define NRF_RADIOCORE_RADIO_S_BASE        0x5302C000UL
#define NRF_RADIOCORE_LRCCONF020_S_BASE   0x5302E000UL
#define NRF_RADIOCORE_SPU030_S_BASE       0x53030000UL
#define NRF_RADIOCORE_PPIB030_S_BASE      0x53031000UL
#define NRF_RADIOCORE_DPPIC030_NS_BASE    0x43032000UL
#define NRF_RADIOCORE_DPPIC030_S_BASE     0x53032000UL
#define NRF_RADIOCORE_VPR_NS_BASE         0x43034000UL
#define NRF_RADIOCORE_VPR_S_BASE          0x53034000UL
#define NRF_RADIOCORE_RAMC001_NS_BASE     0x43038000UL
#define NRF_RADIOCORE_RAMC001_S_BASE      0x53038000UL
#define NRF_RADIOCORE_AAR030_NS_BASE      0x4303A000UL
#define NRF_RADIOCORE_CCM030_NS_BASE      0x4303A000UL
#define NRF_RADIOCORE_AAR030_S_BASE       0x5303A000UL
#define NRF_RADIOCORE_CCM030_S_BASE       0x5303A000UL
#define NRF_RADIOCORE_ECB030_NS_BASE      0x4303B000UL
#define NRF_RADIOCORE_ECB030_S_BASE       0x5303B000UL
#define NRF_RADIOCORE_AAR031_NS_BASE      0x4303C000UL
#define NRF_RADIOCORE_CCM031_NS_BASE      0x4303C000UL
#define NRF_RADIOCORE_AAR031_S_BASE       0x5303C000UL
#define NRF_RADIOCORE_CCM031_S_BASE       0x5303C000UL
#define NRF_RADIOCORE_ECB031_NS_BASE      0x4303D000UL
#define NRF_RADIOCORE_ECB031_S_BASE       0x5303D000UL
#define NRF_RADIOCORE_IPCT_NS_BASE        0x43024000UL
#define NRF_RADIOCORE_IPCT_S_BASE         0x53024000UL
#define NRF_RADIOCORE_SWI0_NS_BASE        0x42058000UL
#define NRF_RADIOCORE_SWI1_NS_BASE        0x42059000UL
#define NRF_RADIOCORE_SWI2_NS_BASE        0x4205A000UL
#define NRF_RADIOCORE_SWI3_NS_BASE        0x4205B000UL
#define NRF_RADIOCORE_SWI4_NS_BASE        0x4205C000UL
#define NRF_RADIOCORE_SWI5_NS_BASE        0x4205D000UL
#define NRF_RADIOCORE_SWI6_NS_BASE        0x4205E000UL
#define NRF_RADIOCORE_SWI7_NS_BASE        0x4205F000UL
#define NRF_RADIOCORE_BELLBOARD_NS_BASE   0x4F09B000UL
#define NRF_RADIOCORE_BELLBOARD_S_BASE    0x5F09B000UL

/* =========================================================================================================================== */
/* ================                                  Peripheral Declaration                                  ================ */
/* =========================================================================================================================== */

#define NRF_RADIOCORE_ICACHEDATA_S        ((NRF_ICACHEDATA_Type*)               NRF_RADIOCORE_ICACHEDATA_S_BASE)
#define NRF_RADIOCORE_ICACHEINFO_S        ((NRF_ICACHEINFO_Type*)               NRF_RADIOCORE_ICACHEINFO_S_BASE)
#define NRF_RADIOCORE_UICR_NS             ((NRF_UICR_Type*)                     NRF_RADIOCORE_UICR_NS_BASE)
#define NRF_RADIOCORE_DCACHEDATA_S        ((NRF_DCACHEDATA_Type*)               NRF_RADIOCORE_DCACHEDATA_S_BASE)
#define NRF_RADIOCORE_DCACHEINFO_S        ((NRF_DCACHEINFO_Type*)               NRF_RADIOCORE_DCACHEINFO_S_BASE)
#define NRF_RADIOCORE_ETM_NS              ((NRF_ETM_Type*)                      NRF_RADIOCORE_ETM_NS_BASE)
#define NRF_RADIOCORE_CTI_S               ((NRF_CTI_Type*)                      NRF_RADIOCORE_CTI_S_BASE)
#define NRF_RADIOCORE_CPUC_S              ((NRF_CM33SS_Type*)                   NRF_RADIOCORE_CPUC_S_BASE)
#define NRF_RADIOCORE_ICACHE_S            ((NRF_CACHE_Type*)                    NRF_RADIOCORE_ICACHE_S_BASE)
#define NRF_RADIOCORE_DCACHE_S            ((NRF_CACHE_Type*)                    NRF_RADIOCORE_DCACHE_S_BASE)
#define NRF_RADIOCORE_SPU000_S            ((NRF_SPU_Type*)                      NRF_RADIOCORE_SPU000_S_BASE)
#define NRF_RADIOCORE_MPC_S               ((NRF_MPC_Type*)                      NRF_RADIOCORE_MPC_S_BASE)
#define NRF_RADIOCORE_MVDMA_NS            ((NRF_MVDMA_Type*)                    NRF_RADIOCORE_MVDMA_NS_BASE)
#define NRF_RADIOCORE_MVDMA_S             ((NRF_MVDMA_Type*)                    NRF_RADIOCORE_MVDMA_S_BASE)
#define NRF_RADIOCORE_RAMC000_NS          ((NRF_RAMC_Type*)                     NRF_RADIOCORE_RAMC000_NS_BASE)
#define NRF_RADIOCORE_RAMC000_S           ((NRF_RAMC_Type*)                     NRF_RADIOCORE_RAMC000_S_BASE)
#define NRF_RADIOCORE_HSFLL_S             ((NRF_HSFLL_Type*)                    NRF_RADIOCORE_HSFLL_S_BASE)
#define NRF_RADIOCORE_LRCCONF000_S        ((NRF_LRCCONF_Type*)                  NRF_RADIOCORE_LRCCONF000_S_BASE)
#define NRF_RADIOCORE_SPU010_S            ((NRF_SPU_Type*)                      NRF_RADIOCORE_SPU010_S_BASE)
#define NRF_RADIOCORE_MEMCONF_NS          ((NRF_MEMCONF_Type*)                  NRF_RADIOCORE_MEMCONF_NS_BASE)
#define NRF_RADIOCORE_MEMCONF_S           ((NRF_MEMCONF_Type*)                  NRF_RADIOCORE_MEMCONF_S_BASE)
#define NRF_RADIOCORE_WDT010_NS           ((NRF_WDT_Type*)                      NRF_RADIOCORE_WDT010_NS_BASE)
#define NRF_RADIOCORE_WDT010_S            ((NRF_WDT_Type*)                      NRF_RADIOCORE_WDT010_S_BASE)
#define NRF_RADIOCORE_WDT011_NS           ((NRF_WDT_Type*)                      NRF_RADIOCORE_WDT011_NS_BASE)
#define NRF_RADIOCORE_WDT011_S            ((NRF_WDT_Type*)                      NRF_RADIOCORE_WDT011_S_BASE)
#define NRF_RADIOCORE_LRCCONF010_S        ((NRF_LRCCONF_Type*)                  NRF_RADIOCORE_LRCCONF010_S_BASE)
#define NRF_RADIOCORE_RESETINFO_S         ((NRF_RESETINFO_Type*)                NRF_RADIOCORE_RESETINFO_S_BASE)
#define NRF_RADIOCORE_SPU020_S            ((NRF_SPU_Type*)                      NRF_RADIOCORE_SPU020_S_BASE)
#define NRF_RADIOCORE_DPPIC020_NS         ((NRF_DPPIC_Type*)                    NRF_RADIOCORE_DPPIC020_NS_BASE)
#define NRF_RADIOCORE_DPPIC020_S          ((NRF_DPPIC_Type*)                    NRF_RADIOCORE_DPPIC020_S_BASE)
#define NRF_RADIOCORE_PPIB020_S           ((NRF_PPIB_Type*)                     NRF_RADIOCORE_PPIB020_S_BASE)
#define NRF_RADIOCORE_EGU020_NS           ((NRF_EGU_Type*)                      NRF_RADIOCORE_EGU020_NS_BASE)
#define NRF_RADIOCORE_EGU020_S            ((NRF_EGU_Type*)                      NRF_RADIOCORE_EGU020_S_BASE)
#define NRF_RADIOCORE_TIMER020_NS         ((NRF_TIMER_Type*)                    NRF_RADIOCORE_TIMER020_NS_BASE)
#define NRF_RADIOCORE_TIMER020_S          ((NRF_TIMER_Type*)                    NRF_RADIOCORE_TIMER020_S_BASE)
#define NRF_RADIOCORE_TIMER021_NS         ((NRF_TIMER_Type*)                    NRF_RADIOCORE_TIMER021_NS_BASE)
#define NRF_RADIOCORE_TIMER021_S          ((NRF_TIMER_Type*)                    NRF_RADIOCORE_TIMER021_S_BASE)
#define NRF_RADIOCORE_TIMER022_NS         ((NRF_TIMER_Type*)                    NRF_RADIOCORE_TIMER022_NS_BASE)
#define NRF_RADIOCORE_TIMER022_S          ((NRF_TIMER_Type*)                    NRF_RADIOCORE_TIMER022_S_BASE)
#define NRF_RADIOCORE_RTC_NS              ((NRF_RTC_Type*)                      NRF_RADIOCORE_RTC_NS_BASE)
#define NRF_RADIOCORE_RTC_S               ((NRF_RTC_Type*)                      NRF_RADIOCORE_RTC_S_BASE)
#define NRF_RADIOCORE_RADIO_NS            ((NRF_RADIO_Type*)                    NRF_RADIOCORE_RADIO_NS_BASE)
#define NRF_RADIOCORE_RADIO_S             ((NRF_RADIO_Type*)                    NRF_RADIOCORE_RADIO_S_BASE)
#define NRF_RADIOCORE_LRCCONF020_S        ((NRF_LRCCONF_Type*)                  NRF_RADIOCORE_LRCCONF020_S_BASE)
#define NRF_RADIOCORE_SPU030_S            ((NRF_SPU_Type*)                      NRF_RADIOCORE_SPU030_S_BASE)
#define NRF_RADIOCORE_PPIB030_S           ((NRF_PPIB_Type*)                     NRF_RADIOCORE_PPIB030_S_BASE)
#define NRF_RADIOCORE_DPPIC030_NS         ((NRF_DPPIC_Type*)                    NRF_RADIOCORE_DPPIC030_NS_BASE)
#define NRF_RADIOCORE_DPPIC030_S          ((NRF_DPPIC_Type*)                    NRF_RADIOCORE_DPPIC030_S_BASE)
#define NRF_RADIOCORE_VPR_NS              ((NRF_VPR_Type*)                      NRF_RADIOCORE_VPR_NS_BASE)
#define NRF_RADIOCORE_VPR_S               ((NRF_VPR_Type*)                      NRF_RADIOCORE_VPR_S_BASE)
#define NRF_RADIOCORE_RAMC001_NS          ((NRF_RAMC_Type*)                     NRF_RADIOCORE_RAMC001_NS_BASE)
#define NRF_RADIOCORE_RAMC001_S           ((NRF_RAMC_Type*)                     NRF_RADIOCORE_RAMC001_S_BASE)
#define NRF_RADIOCORE_AAR030_NS           ((NRF_AAR_Type*)                      NRF_RADIOCORE_AAR030_NS_BASE)
#define NRF_RADIOCORE_CCM030_NS           ((NRF_CCM_Type*)                      NRF_RADIOCORE_CCM030_NS_BASE)
#define NRF_RADIOCORE_AAR030_S            ((NRF_AAR_Type*)                      NRF_RADIOCORE_AAR030_S_BASE)
#define NRF_RADIOCORE_CCM030_S            ((NRF_CCM_Type*)                      NRF_RADIOCORE_CCM030_S_BASE)
#define NRF_RADIOCORE_ECB030_NS           ((NRF_ECB_Type*)                      NRF_RADIOCORE_ECB030_NS_BASE)
#define NRF_RADIOCORE_ECB030_S            ((NRF_ECB_Type*)                      NRF_RADIOCORE_ECB030_S_BASE)
#define NRF_RADIOCORE_AAR031_NS           ((NRF_AAR_Type*)                      NRF_RADIOCORE_AAR031_NS_BASE)
#define NRF_RADIOCORE_CCM031_NS           ((NRF_CCM_Type*)                      NRF_RADIOCORE_CCM031_NS_BASE)
#define NRF_RADIOCORE_AAR031_S            ((NRF_AAR_Type*)                      NRF_RADIOCORE_AAR031_S_BASE)
#define NRF_RADIOCORE_CCM031_S            ((NRF_CCM_Type*)                      NRF_RADIOCORE_CCM031_S_BASE)
#define NRF_RADIOCORE_ECB031_NS           ((NRF_ECB_Type*)                      NRF_RADIOCORE_ECB031_NS_BASE)
#define NRF_RADIOCORE_ECB031_S            ((NRF_ECB_Type*)                      NRF_RADIOCORE_ECB031_S_BASE)
#define NRF_RADIOCORE_IPCT_NS             ((NRF_IPCT_Type*)                     NRF_RADIOCORE_IPCT_NS_BASE)
#define NRF_RADIOCORE_IPCT_S              ((NRF_IPCT_Type*)                     NRF_RADIOCORE_IPCT_S_BASE)
#define NRF_RADIOCORE_SWI0_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI0_NS_BASE)
#define NRF_RADIOCORE_SWI1_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI1_NS_BASE)
#define NRF_RADIOCORE_SWI2_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI2_NS_BASE)
#define NRF_RADIOCORE_SWI3_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI3_NS_BASE)
#define NRF_RADIOCORE_SWI4_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI4_NS_BASE)
#define NRF_RADIOCORE_SWI5_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI5_NS_BASE)
#define NRF_RADIOCORE_SWI6_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI6_NS_BASE)
#define NRF_RADIOCORE_SWI7_NS             ((NRF_SWI_Type*)                      NRF_RADIOCORE_SWI7_NS_BASE)
#define NRF_RADIOCORE_BELLBOARD_NS        ((NRF_BELLBOARD_Type*)                NRF_RADIOCORE_BELLBOARD_NS_BASE)
#define NRF_RADIOCORE_BELLBOARD_S         ((NRF_BELLBOARD_Type*)                NRF_RADIOCORE_BELLBOARD_S_BASE)

/* =========================================================================================================================== */
/* ================                                    TrustZone Remapping                                    ================ */
/* =========================================================================================================================== */

